app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2017-06-12 20:13:46.199657"], ["updated_at", "2017-06-12 20:13:46.199657"]]
---
  def create
    @school_class = SchoolClass.new((params.require(:school_class).permit(:title, :room_number)))
    @school_class.save