app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2017-06-12 20:13:46.218680"], ["updated_at", "2017-06-12 20:13:46.218680"]]
---
  def create
    @student = Student.new((params.require(:student).permit(:first_name, :last_name)))
    @student.save